{"class_name": "Functional", "config": {"name": "RNA", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2700], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_img"}, "name": "input_img", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "hidd_1", "trainable": true, "dtype": "float32", "units": 540, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidd_1", "inbound_nodes": [[["input_img", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "hidd_2", "trainable": true, "dtype": "float32", "units": 135, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidd_2", "inbound_nodes": [[["hidd_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "hidd_3", "trainable": true, "dtype": "float32", "units": 27, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidd_3", "inbound_nodes": [[["hidd_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "hidd_4", "trainable": true, "dtype": "float32", "units": 9, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "hidd_4", "inbound_nodes": [[["hidd_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output", "inbound_nodes": [[["hidd_4", 0, 0, {}]]]}], "input_layers": [["input_img", 0, 0]], "output_layers": [["output", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}